In [1]:
import pandas as pd

In [2]:
data = {
    "merchant_id": ['qtz-837-mnb-294', 'vxl-512-ghj-763', 'prk-924-zxc-105', 'mfs-376-lkd-842', 'jdn-689-qwe-417'],
    "merchant_state": ["CA", "NY", "TX", "FL", "WA"],
    "merchant_city": ["Los Angeles", "New York", "Dallas", "Tampa", "Seattle"],
    "merchant_volume": [50000, 75000, 30000, 90000, 45000]
}
df=pd.DataFrame(data)

In [3]:
df.set_index('merchant_id',inplace=True)

In [4]:
df.head()

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000
prk-924-zxc-105             TX        Dallas            30000
mfs-376-lkd-842             FL         Tampa            90000
jdn-689-qwe-417             WA       Seattle            45000

In [5]:
df.loc['qtz-837-mnb-294']

merchant_state              CA
merchant_city      Los Angeles
merchant_volume          50000
Name: qtz-837-mnb-294, dtype: object

In [6]:
df.loc[['qtz-837-mnb-294','vxl-512-ghj-763']]

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000

In [8]:
df.loc['vxl-512-ghj-763',['merchant_state','merchant_city']]

merchant_state          NY
merchant_city     New York
Name: vxl-512-ghj-763, dtype: object

In [10]:
df.loc['vxl-512-ghj-763',['merchant_state']]

merchant_state    NY
Name: vxl-512-ghj-763, dtype: object

In [11]:
df.loc['vxl-512-ghj-763','merchant_state']

'NY'

In [13]:
df.loc[['qtz-837-mnb-294','vxl-512-ghj-763'],['merchant_state','merchant_city']]

                merchant_state merchant_city
merchant_id
qtz-837-mnb-294             CA   Los Angeles
vxl-512-ghj-763             NY      New York

In [ ]:
# filtering the data
df.loc[df['merchant_state']=='FL']

                merchant_state merchant_city  merchant_volume
merchant_id
mfs-376-lkd-842             FL         Tampa            90000

In [15]:
df.loc[df['merchant_volume']>=50000]

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000
mfs-376-lkd-842             FL         Tampa            90000

In [16]:
df.loc[df['merchant_volume']>=50000,['merchant_city','merchant_volume']]

                merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294   Los Angeles            50000
vxl-512-ghj-763      New York            75000
mfs-376-lkd-842         Tampa            90000

In [ ]:
# by using and condition please not forgot place the conditions into paranthesis 
df.loc[(df['merchant_state']=='FL') & (df['merchant_volume']>=50000)]

                merchant_state merchant_city  merchant_volume
merchant_id
mfs-376-lkd-842             FL         Tampa            90000

In [19]:
df.loc[(df['merchant_state'] == 'WA') | (df['merchant_volume'] >= 50000)]

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000
mfs-376-lkd-842             FL         Tampa            90000
jdn-689-qwe-417             WA       Seattle            45000

In [20]:
df.loc[(df['merchant_state'] == 'WA') | (df['merchant_volume'] >= 50000),['merchant_city','merchant_volume']]

                merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294   Los Angeles            50000
vxl-512-ghj-763      New York            75000
mfs-376-lkd-842         Tampa            90000
jdn-689-qwe-417       Seattle            45000

In [21]:
# modifying data 
df.loc['mfs-376-lkd-842','merchant_state']

'FL'

In [22]:
df.loc['mfs-376-lkd-842','merchant_state']='KS'

In [23]:
df

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000
prk-924-zxc-105             TX        Dallas            30000
mfs-376-lkd-842             KS         Tampa            90000
jdn-689-qwe-417             WA       Seattle            45000

In [24]:
# slicing
df.loc[:,'merchant_city']

merchant_id
qtz-837-mnb-294    Los Angeles
vxl-512-ghj-763       New York
prk-924-zxc-105         Dallas
mfs-376-lkd-842          Tampa
jdn-689-qwe-417        Seattle
Name: merchant_city, dtype: object

In [25]:
df.loc['qtz-837-mnb-294':'jdn-689-qwe-417']

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
vxl-512-ghj-763             NY      New York            75000
prk-924-zxc-105             TX        Dallas            30000
mfs-376-lkd-842             KS         Tampa            90000
jdn-689-qwe-417             WA       Seattle            45000

In [26]:
df.loc[:,'merchant_state':'merchant_city']

                merchant_state merchant_city
merchant_id
qtz-837-mnb-294             CA   Los Angeles
vxl-512-ghj-763             NY      New York
prk-924-zxc-105             TX        Dallas
mfs-376-lkd-842             KS         Tampa
jdn-689-qwe-417             WA       Seattle

In [27]:
df.loc[: : 2]

                merchant_state merchant_city  merchant_volume
merchant_id
qtz-837-mnb-294             CA   Los Angeles            50000
prk-924-zxc-105             TX        Dallas            30000
jdn-689-qwe-417             WA       Seattle            45000